# Запрашиваем начальное, конечное значение аргумента и шаг
X_beg = float(input("Введите Xbeg: "))
X_end = float(input("Введите Xend: "))
dx = float(input("Введите шаг dx: "))

# Выводим шапку таблицы
print("+----------+----------+")
print("|    X     |    Y     |")
print("+----------+----------+")

# Задаем начальное значение текущего аргумента
xt = X_beg

# Запускаем цикл с предусловием, пока текущий x не превышает конечное значение
while xt <= X_end:
    # Вычисляем значение функции по кусочно-заданным условиям (из ЛР2)
    if xt < -4:
        y = -2
    elif -4 <= xt < 0:
        y = (xt**2) / 4 + xt
    elif 0 <= xt < 2:
        y = 2 * xt
    else:
        y = -0.5 * xt + 5
    
    # Выводим строку таблицы с отформатированными значениями
    print("| {0: 7.4f} | {1: 7.4f} |".format(xt, y))
    
    # Увеличиваем текущее значение аргумента на шаг
    xt += dx

# Выводим нижнюю границу таблицы
print("+----------+----------+")